#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>


//~按（二进制）位取反
int main()
{
	int a = 0;
 /*
 * 具体操作：
 	~按（二进制）位取反
	00000000000000000000000000000000  -->0的二进制位
	11111111111111111111111111111111  -->~a取反，这个是补码，需要转换成原码，补码减1得到反码，反码符号位不变，其他位取反得到原码
	11111111111111111111111111111110  -->反码 ，补码减1
	10000000000000000000000000000001  -->原码 ，符号位不变，其他位按位取反
 */

	printf("%d\n", ~a);  //结果为-1
	return 0;
}


//1.按位或操作
int main()
{
	int a = 11;
	/*
	具体实现：
	11的二进制00000000000000000000000000001011 把1011改变成1111
	1的二进制00000000000000000000000000000001
	1左移动2位00000000000000000000000000000100 ,左边丢弃，右边补0
	11|（1<<2)00000000000000000000000000001111 ,按位或，只要该位有1个1结果就为1，同时为1也为1，同时为0就为0；
	*/
	a = a | (1 << 2);
	printf("%d\n", a);
	return 0;
}


//2.按位异或/按位与，按位取反操作，相同为0，相异为1
int main()
{
	int a = 15;
	//a = a ^ (1 << 2); //按位异或操作
	a = a & (~(1 << 2));//左移两位，按位取反，再按位与
	printf("%d\n", a);
	return 0;
}
	/*
	具体实现：
	1.按位异或
	00000000000000000000000000001111 -->11的二进制
	00000000000000000000000000000100 -->1左移两位的二进制位
	00000000000000000000000000001011 -->结果,按位异或，相同为0，向异为1

	2.按位取反，再按位与
	00000000000000000000000000001111 -->11的二进制
	11111111111111111111111111111011 -->1的二进制位取反，1为0, 0为1
	00000000000000000000000000001011 -->结果， 按位与，有1个为0就为0，只要两个都为1才为1

	*/

